
export enum StBlock {
    /** 静态 */
    Static,
    /** 空白 */
    Blank = 0,
    /** 候选 */
    Candidate,
    /** 错误 */
    Error,
}

/** 方块信息 */
export interface BlockInfo {
    id: number;
    row: number;
    col: number;
    /** 0: 空白, 1: 静态,  2: 候选, 3: 错误 */
    type: number;
    value: number;
    isSelect: boolean;
}

/** 九宫格信息 */
export interface NonetInfo {
    id: number;
    blocks: BlockInfo[];
}

/**
 *[
 *   ["4",       "-167",    "2",      "5",    "-167",   "-16",   "3",     "8",    "9"  ],
 *   ["-13789",  "-13789",  "-3789",  "-79",  "4",      "-189",  "2",     "6",    "5"  ],
 *   ["-89",     "-689",    "5",      "2",    "3",      "-689",  "1",     "4",    "7"  ],
 *   ["-389",    "-389",    "1",      "6",    "5",      "2",     "-48",   "7",    "48" ],
 *   ["6",       "-78",     "-78",    "1",    "9",      "4",     "5",     "3",    "2"  ],
 *   ["2",       "5",       "4",      "3",    "8",      "7",     "6",     "9",    "1"  ],
 *   ["5",       "-246789", "-6789",  "-79",  "-267",   "3",     "-478",  "1",    "-468"],
 *   ["-1378",   "-123678", "-3678",  "4",    "-1267",  "-156",  "9",     "-25",  "-68" ],
 *   ["-179",    "-124679", "-679",   "8",    "-1267",  "-1569", "-47",   "-25",  "3"  ]
 *]
 */
/** 地图信息 */
export interface BoardInfo {
    /** 标识 */
    id: number;
    /** 等级 */
    level: number;
    /** 牌面 */
    board: number[][];
    /** 预设 */
    candidates: number[][];
}